two types of pandas 
1-series :-
form in array
create series using numpy

2-DataFrame:-
form in Datasets like:-
excel,csv, format

# pandas Series:-

In [1]:
import numpy as np
import pandas as pd
Data=[1,3,4,5,6,2,9]
a=pd.Series(Data)
print(a)
print(type(a))

0    1
1    3
2    4
3    5
4    6
5    2
6    9
dtype: int64
<class 'pandas.core.series.Series'>

In [3]:
import numpy as np
import pandas as pd
Data=[12.05,5,1,3,4,5,6,2,9]
a=pd.Series(Data)
print(a)
print(type(a))

0    12.05
1     5.00
2     1.00
3     3.00
4     4.00
5     5.00
6     6.00
7     2.00
8     9.00
dtype: float64
<class 'pandas.core.series.Series'>

In [3]:
import pandas as pd
import numpy as np
data=[10,20,30,40,50]
z=pd.Series(data)
print(z)
print(type(z))

0    10
1    20
2    30
3    40
4    50
dtype: int64
<class 'pandas.core.series.Series'>

In [2]:
import numpy as np
import pandas as pd
Data=[1,3,4,5,6,2,9,10,11,12,13,14,15]
a=pd.Series(Data)
a

0      1
1      3
2      4
3      5
4      6
5      2
6      9
7     10
8     11
9     12
10    13
11    14
12    15
dtype: int64

In [2]:
# how to chng index number

In [3]:
Data=[1,3,4,5,6,2,9]
Index=['a','b','c','d','e','f','g']
a=pd.Series(Data,index=Index)
print(a)

a    1
b    3
c    4
d    5
e    6
f    2
g    9
dtype: int64

In [4]:
# how to create series using dictionary

In [3]:
dictionary={'a':1,'b':2,'c':3, 'd':4,'e':5,'f':6}
sd=pd.Series(dictionary)
print(sd)

a    1
b    2
c    3
d    4
e    5
f    6
dtype: int64

In [4]:
import pandas as pd
dict = {}
for i in range(1,10):
    dict[chr(96+i)] = i
df = pd.Series(dict)
print(df)

a    1
b    2
c    3
d    4
e    5
f    6
g    7
h    8
i    9
dtype: int64

In [4]:
#  when data contains Ndarray
Data=[[1,2,3],[4,5,6],[7,8,9],[1,2,3],[1,2]]
snd=pd.Series(Data)
snd

0    [1, 2, 3]
1    [4, 5, 6]
2    [7, 8, 9]
3    [1, 2, 3]
4       [1, 2]
dtype: object

In [1]:
import pandas as pd
import numpy as np# it is used for array 
z=pd.Series(np.random.randn(15))
z

0     1.436286
1     0.007545
2    -0.527607
3     1.472108
4     0.246403
5    -0.128739
6     1.188314
7    -1.327055
8    -1.404294
9    -0.494833
10   -0.831714
11    1.553479
12    0.527516
13   -0.090465
14   -0.190579
dtype: float64

# Dataframe:-

DataFrame is a table. It has rows and columns. Each column in a DataFrame is a Series object, rows consist of elements inside Series.

DataFrame can be constructed using built-in Python dicts.

In [2]:
import pandas as pd
df = pd.DataFrame({
     'country': ['India', 'Russia', 'Belarus', 'Ukraine'],
     'population': [125.04, 143.5, 9.5, 45.5],
    'square': [2724902, 17125191, 207600, 603628]
})
#print(df)
df

   country  population    square
0    India      125.04   2724902
1   Russia      143.50  17125191
2  Belarus        9.50    207600
3  Ukraine       45.50    603628

In order to make sure that each column is a Series object let’s do this:

In [3]:
df['country']

0      India
1     Russia
2    Belarus
3    Ukraine
Name: country, dtype: object

In [11]:
type(df['country'])

pandas.core.series.Series

In [12]:
df.columns

Index(['country', 'population', 'square'], dtype='object')

In [13]:
df.index

RangeIndex(start=0, stop=4, step=1)

# Accessing elements by Index:

There are numerous ways to provide row index explicitly, for example you can provide index when creating a "DataFrame or do it “on the fly” during runtime:

In [2]:
import pandas as pd
df = pd.DataFrame({
     'country': ['India', 'Russia', 'Belarus', 'Ukraine'],
     'population': [125.04, 143.5, 9.5, 45.5],
     'square': [2724902, 17125191, 207600, 603628]
},index=['IND', 'RU', 'BY', 'UA'])
df

     country  population    square
IND    India      125.04   2724902
RU    Russia      143.50  17125191
BY   Belarus        9.50    207600
UA   Ukraine       45.50    603628

In [3]:
df.index = ['IND', 'RU', 'BY', 'UA']
df.index.name = 'Country Code'
df

              country  population    square
Country Code
IND             India      125.04   2724902
RU             Russia      143.50  17125191
BY            Belarus        9.50    207600
UA            Ukraine       45.50    603628

Besides creating an index I have also named it as Country Code. Series object will also have the same index as DataFrame has:

In [16]:
df['country']

Country Code
IND      India
RU      Russia
BY     Belarus
UA     Ukraine
Name: country, dtype: object

WAP to create table for employees data store and apply all method of pandas?

# Row access using index can be performed in several ways:

1-using .loc and providing index label
2-using .iloc and providing index number

In [7]:
import pandas as pd
df = pd.DataFrame({
     'country': ['India', 'Russia', 'Belarus', 'Ukraine'],
     'population': [125.04, 143.5, 9.5, 45.5],
     'square': [2724902, 17125191, 207600, 603628]
}, index=['IND', 'RU', 'BY', 'UA'])
df

     country  population    square
IND    India      125.04   2724902
RU    Russia      143.50  17125191
BY   Belarus        9.50    207600
UA   Ukraine       45.50    603628

In [4]:
df.loc['IND'] # work with label

country         India
population     125.04
square        2724902
Name: IND, dtype: object

In [10]:
df.iloc[0] # work with index number

country         India
population     125.04
square        2724902
Name: IND, dtype: object

In [20]:
df.iloc[3]

country       Ukraine
population       45.5
square         603628
Name: UA, dtype: object

In [8]:
df.loc[['IND', 'RU'], 'population']

IND    125.04
RU     143.50
Name: population, dtype: float64

.loc takes 2 arguments: index list and column list, slicing operation is supported as well:

In [9]:
df.loc['IND':'BY', :]# [rows,column]

     country  population    square
IND    India      125.04   2724902
RU    Russia      143.50  17125191
BY   Belarus        9.50    207600

In [10]:
df.loc['IND':'UA',:]

     country  population    square
IND    India      125.04   2724902
RU    Russia      143.50  17125191
BY   Belarus        9.50    207600
UA   Ukraine       45.50    603628

Filtering is performed using so-called Boolean arrays:

In [11]:
df[df.population > 10][['country', 'square']]

     country    square
IND    India   2724902
RU    Russia  17125191
UA   Ukraine    603628

In [24]:
df.population > 10

IND     True
RU      True
BY     False
UA      True
Name: population, dtype: bool

By the way, columns can be accessed using attribute or Python dict notation, for example df.population and df[‘population’] are the same operations.

If you want to reset index, no problem

In [15]:
df.reset_index()

  index  country  population    square
0   IND    India      125.04   2724902
1    RU   Russia      143.50  17125191
2    BY  Belarus        9.50    207600
3    UA  Ukraine       45.50    603628

By default when you manipulate a DataFrame, pandas will return a new instance (the old one will not be affected).

Let’s add new column with population density:

In [16]:
df['density'] = df['population'] / df['square'] * 1000000
df

     country  population    square    density
IND    India      125.04   2724902  45.887889
RU    Russia      143.50  17125191   8.379469
BY   Belarus        9.50    207600  45.761079
UA   Ukraine       45.50    603628  75.377550

Don’t like new column? OK, let’s delete it:

In [17]:
df.drop(['density'], axis='columns')

     country  population    square
IND    India      125.04   2724902
RU    Russia      143.50  17125191
BY   Belarus        9.50    207600
UA   Ukraine       45.50    603628

In [ ]:
z=.drop(['Unnamed: 9'], axis='columns')

If you are too lazy to type drop… you can use del df[‘density’]

Rename it!

In [18]:
df = df.rename(columns={'country': 'Country'})
df

     Country  population    square    density
IND    India      125.04   2724902  45.887889
RU    Russia      143.50  17125191   8.379469
BY   Belarus        9.50    207600  45.761079
UA   Ukraine       45.50    603628  75.377550

In our renaming example make sure that you dropped the index otherwise invoking rename method will have no effect.

WAP to print employees record using pandas and perform all method of pandas?

# Pandas Merging, Joining, and Concatenating

A Data frame is a two-dimensional data structure, i.e., data is aligned in a tabular fashion in rows and columns. We can join, merge, and concat dataframe using different methods. In Dataframe df.merge(),df.join(), and df.concat() methods help in joining, merging and concating different dataframe.

In order to concat dataframe, we use concat() function which helps in concatenating a dataframe. We can concat a dataframe in many different ways, they are

1-Concatenating DataFrame using .concat()
2-Concatenating DataFrame by setting logic on axes
3-Concatenating DataFrame using .append()
4-Concatenating DataFrame by ignoring indexes
5-Concatenating DataFrame with group keys
6-Concatenating with mixed ndims

Concatenating DataFrame using .concat() :
In order to concat a dataframe, we use .concat() function this function concat a dataframe and returns a new dataframe.

In [1]:
import pandas as pd 
 
# Define a dictionary containing employee data 
data1 = {'Name':['Rahul', 'Princi', 'Gaurav', 'Anuj'], 
        'Age':[27, 25, 26, 32], 
        'Address':['Nagpur', 'Kanpur', 'Delhi', 'Kannuaj'], 
        'Qualification':['Msc', 'MA', 'MCA', 'Phd']} 
   
# Define a dictionary containing employee data 
data2 = {'Name':['Abhi', 'Ayushi', 'Vanshika', 'Sarita'], 
        'Age':[17, 14, 23, 24], 
        'Address':['Nagpur', 'Kanpur', 'Delhi', 'Aligarh'], 
        'Qualification':['Btech', 'B.A', 'BSc', 'PGDM']} 
 
# Convert the dictionary into DataFrame  
df = pd.DataFrame(data1,index=[0, 1, 2, 3])
 
# Convert the dictionary into DataFrame  
df1 = pd.DataFrame(data2, index=[4, 5, 6, 7])
 
print(df, "\n\n", df1)

     Name  Age  Address Qualification
0   Rahul   27   Nagpur           Msc
1  Princi   25   Kanpur            MA
2  Gaurav   26    Delhi           MCA
3    Anuj   32  Kannuaj           Phd

        Name  Age  Address Qualification
4      Abhi   17   Nagpur         Btech
5    Ayushi   14   Kanpur           B.A
6  Vanshika   23    Delhi           BSc
7    Sarita   24  Aligarh          PGDM

Now we apply .concat function in order to concat two dataframe

In [2]:
# using a .concat() method
frames = [df, df1]
 
x = pd.concat(frames)
x

       Name  Age  Address Qualification
0     Rahul   27   Nagpur           Msc
1    Princi   25   Kanpur            MA
2    Gaurav   26    Delhi           MCA
3      Anuj   32  Kannuaj           Phd
4      Abhi   17   Nagpur         Btech
5    Ayushi   14   Kanpur           B.A
6  Vanshika   23    Delhi           BSc
7    Sarita   24  Aligarh          PGDM

Concatenating DataFrame by setting logic on axes :

In order to concat dataframe, we have to set different logic on axes. We can set axes in the following three ways

1- Taking the union of them all, join='outer'. This is the default option as it    results in zero information loss.
2- Taking the intersection, join='inner'.
3- Use a specific index, as passed to the join_axes argument

Different Types of SQL JOINs
Here are the different types of the JOINs in SQL:

(INNER) JOIN: Returns records that have matching values in both tables.

LEFT (OUTER) JOIN: Returns all records from the left table, and the matched records from the right table.

RIGHT (OUTER) JOIN: Returns all records from the right table, and the matched records from the left table.

FULL (OUTER) JOIN: Returns all records when there is a match in either left or right table.

SQL INNER JOIN  SQL LEFT JOIN  SQL RIGHT JOIN  SQL FULL OUTER JOIN

In [10]:
import pandas as pd 
 
# Define a dictionary containing employee data 
data1 = {'Name':['Rahul', 'Princi', 'Gaurav', 'Anuj'], 
        'Age':[27, 25, 26, 32], 
        'Address':['Nagpur', 'Kanpur', 'Delhi', 'Kannuaj'], 
        'Qualification':['Msc', 'MA', 'MCA', 'Phd'],
        'Mobile No': [1234567891, 9134567891, 9876543211, 7819456123]}
   
# Define a dictionary containing employee data 
data2 = {'Name':['Abhi', 'Ayushi', 'Vanshika', 'Sarita'], 
        'Age':[17, 14, 23, 24], 
        'Address':['Nagpur', 'Kanpur', 'Delhi', 'Aligarh'], 
        'Qualification':['Btech', 'B.A', 'BSc', 'PGDM'],
         'Salary':[1000, 2000, 3000, 4000]} 
 
# Convert the dictionary into DataFrame  
df = pd.DataFrame(data1,index=[0, 1, 2, 3])
 
# Convert the dictionary into DataFrame  
df1 = pd.DataFrame(data2, index=[4, 5, 6, 7])
 
print(df, "\n\n", df1)

     Name  Age  Address Qualification   Mobile No
0   Rahul   27   Nagpur           Msc  1234567891
1  Princi   25   Kanpur            MA  9134567891
2  Gaurav   26    Delhi           MCA  9876543211
3    Anuj   32  Kannuaj           Phd  7819456123

        Name  Age  Address Qualification  Salary
4      Abhi   17   Nagpur         Btech    1000
5    Ayushi   14   Kanpur           B.A    2000
6  Vanshika   23    Delhi           BSc    3000
7    Sarita   24  Aligarh          PGDM    4000

Now we set axes join = inner for intersection of dataframe

In [8]:
# applying concat with axes
# join = 'inner'
y = pd.concat([df, df1], axis=1, join='inner')
y

Empty DataFrame
Columns: [Name, Age, Address, Qualification, Mobile No, Name, Age, Address, Qualification, Salary]
Index: []

In [11]:
# applying concat with axes
# join = 'inner'
y = pd.concat([df, df1], axis=0, join='inner')
y

       Name  Age  Address Qualification
0     Rahul   27   Nagpur           Msc
1    Princi   25   Kanpur            MA
2    Gaurav   26    Delhi           MCA
3      Anuj   32  Kannuaj           Phd
4      Abhi   17   Nagpur         Btech
5    Ayushi   14   Kanpur           B.A
6  Vanshika   23    Delhi           BSc
7    Sarita   24  Aligarh          PGDM

Now we set axes join = outer for union of dataframe.

In [5]:
# using a .concat for
# union of dataframe
z= pd.concat([df, df1], axis=1, sort=False)
z

,Name,Age,Address,Qualification,Mobile No,Name,Age,Address,Qualification,Salary
0,Rahul,27.0,Nagpur,Msc,1.234568e+09,NaN,NaN,NaN,NaN,NaN
1,Princi,25.0,Kanpur,MA,9.134568e+09,NaN,NaN,NaN,NaN,NaN
2,Gaurav,26.0,Delhi,MCA,9.876543e+09,NaN,NaN,NaN,NaN,NaN
3,Anuj,32.0,Kannuaj,Phd,7.819456e+09,NaN,NaN,NaN,NaN,NaN
4,NaN,NaN,NaN,NaN,NaN,Abhi,17.0,Nagpur,Btech,1000.0
5,NaN,NaN,NaN,NaN,NaN,Ayushi,14.0,Kanpur,B.A,2000.0
6,NaN,NaN,NaN,NaN,NaN,Vanshika,23.0,Delhi,BSc,3000.0
7,NaN,NaN,NaN,NaN,NaN,Sarita,24.0,Aligarh,PGDM,4000.0

Now we used a specific index, as passed to the join_axes argument

In [12]:
# using join_axes
x1 = pd.concat([df, df1], axis=1, join_axes=[df.index])
x1

C:\Users\lapi\Anaconda3\lib\site-packages\ipykernel_launcher.py:2: FutureWarning: The join_axes-keyword is deprecated. Use .reindex or .reindex_like on the result to achieve the same functionality.

,Name,Age,Address,Qualification,Mobile No,Name,Age,Address,Qualification,Salary
0,Rahul,27,Nagpur,Msc,1234567891,NaN,NaN,NaN,NaN,NaN
1,Princi,25,Kanpur,MA,9134567891,NaN,NaN,NaN,NaN,NaN
2,Gaurav,26,Delhi,MCA,9876543211,NaN,NaN,NaN,NaN,NaN
3,Anuj,32,Kannuaj,Phd,7819456123,NaN,NaN,NaN,NaN,NaN

In [14]:
x2 = pd.concat([df, df1], axis=1, join_axes=[df1.index])
x2

C:\Users\lapi\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: The join_axes-keyword is deprecated. Use .reindex or .reindex_like on the result to achieve the same functionality.
  """Entry point for launching an IPython kernel.

,Name,Age,Address,Qualification,Mobile No,Name,Age,Address,Qualification,Salary
4,NaN,NaN,NaN,NaN,NaN,Abhi,17,Nagpur,Btech,1000
5,NaN,NaN,NaN,NaN,NaN,Ayushi,14,Kanpur,B.A,2000
6,NaN,NaN,NaN,NaN,NaN,Vanshika,23,Delhi,BSc,3000
7,NaN,NaN,NaN,NaN,NaN,Sarita,24,Aligarh,PGDM,4000

# Concatenating DataFrame using .append()

In order to concat a dataframe, we use .append() function this function concatenate along axis=0, namely the index. This function exist before .concat.

In [15]:
import pandas as pd 
 
# Define a dictionary containing employee data 
data1 = {'Name':['Rahul', 'Princi', 'Gaurav', 'Anuj'], 
        'Age':[27, 25, 26, 32], 
        'Address':['Nagpur', 'Kanpur', 'Delhi', 'Kannuaj'], 
        'Qualification':['Msc','MA','MCA','Phd']} 
   
# Define a dictionary containing employee data 
data2 = {'Name':['Abhi', 'Ayushi', 'Vanshika', 'Sarita'], 
        'Age':[17, 14, 23, 24], 
        'Address':['Nagpur', 'Kanpur', 'Delhi', 'Aligarh'], 
        'Qualification':['Btech', 'B.A', 'BSc', 'PGDM']} 
 
# Convert the dictionary into DataFrame  
df = pd.DataFrame(data1,index=[0, 1, 2, 3])
 
# Convert the dictionary into DataFrame  
df1 = pd.DataFrame(data2, index=[4, 5, 6, 7])
 
print(df, "\n\n", df1)

     Name  Age  Address Qualification
0   Rahul   27   Nagpur           Msc
1  Princi   25   Kanpur            MA
2  Gaurav   26    Delhi           MCA
3    Anuj   32  Kannuaj           Phd

        Name  Age  Address Qualification
4      Abhi   17   Nagpur         Btech
5    Ayushi   14   Kanpur           B.A
6  Vanshika   23    Delhi           BSc
7    Sarita   24  Aligarh          PGDM

Now we apply .append() function inorder to concat to dataframe

In [16]:
# using append function
y1= df.append(df1)
y1

       Name  Age  Address Qualification
0     Rahul   27   Nagpur           Msc
1    Princi   25   Kanpur            MA
2    Gaurav   26    Delhi           MCA
3      Anuj   32  Kannuaj           Phd
4      Abhi   17   Nagpur         Btech
5    Ayushi   14   Kanpur           B.A
6  Vanshika   23    Delhi           BSc
7    Sarita   24  Aligarh          PGDM

# Concatenating DataFrame by ignoring indexes :

In order to concat a dataframe by ignoring indexes, we ignore index which don’t have a meaningfull meaning, you may wish to append them and ignore the fact that they
may have overlapping indexes. In order to do that we use ignore_index as an argument.

In [24]:
import pandas as pd 
 
# Define a dictionary containing employee data 
data1 = {'Name':['Rahul', 'Princi', 'Gaurav', 'Anuj'], 
        'Age':[27, 25, 26, 32], 
        'Address':['Nagpur', 'Kanpur', 'Delhi', 'Kannuaj'], 
        'Qualification':['Msc', 'MA', 'MCA', 'Phd']} 
   
# Define a dictionary containing employee data 
data2 = {'Name':['Abhi', 'Ayushi', 'Vanshika', 'Sarita'], 
        'Age':[17, 14, 23, 24], 
        'Address':['Nagpur', 'Kanpur', 'Delhi', 'Aligarh'], 
        'Qualification':['Btech', 'B.A', 'BSc', 'PGDM']} 
 
# Convert the dictionary into DataFrame  
df = pd.DataFrame(data1,index=[0, 1, 2, 3])
 
# Convert the dictionary into DataFrame  
df1 = pd.DataFrame(data2, index=[4, 5, 6, 7])
 
print(df, "\n\n", df1)

     Name  Age  Address Qualification
0   Rahul   27   Nagpur           Msc
1  Princi   25   Kanpur            MA
2  Gaurav   26    Delhi           MCA
3    Anuj   32  Kannuaj           Phd

        Name  Age  Address Qualification
4      Abhi   17   Nagpur         Btech
5    Ayushi   14   Kanpur           B.A
6  Vanshika   23    Delhi           BSc
7    Sarita   24  Aligarh          PGDM

Now we are going to apply ignore_index as an argument.

In [25]:
# using ignore_index
z= pd.concat([df, df1], ignore_index=True)
z

       Name  Age  Address Qualification
0     Rahul   27   Nagpur           Msc
1    Princi   25   Kanpur            MA
2    Gaurav   26    Delhi           MCA
3      Anuj   32  Kannuaj           Phd
4      Abhi   17   Nagpur         Btech
5    Ayushi   14   Kanpur           B.A
6  Vanshika   23    Delhi           BSc
7    Sarita   24  Aligarh          PGDM

In [20]:
# using ignore_index
z= pd.concat([df2, df3], ignore_index=False)
z

NameError: name 'df2' is not defined

# Concatenating DataFrame with group keys :

In order to concat dataframe with group keys, we override the column names with the use of the keys argument. Keys argument is to override the column names when creating a new DataFrame based on existing Series.

In [26]:
import pandas as pd 
 
# Define a dictionary containing employee data 
data1 = {'Name':['Rahul', 'Princi', 'Gaurav', 'Anuj'], 
        'Age':[27, 25, 26, 32], 
        'Address':['Nagpur', 'Kanpur', 'Delhi', 'Kannuaj'], 
        'Qualification':['Msc', 'MA', 'MCA', 'Phd']} 
   
# Define a dictionary containing employee data 
data2 = {'Name':['Abhi', 'Ayushi', 'Vanshika', 'Sarita'], 
        'Age':[17, 14, 23, 24], 
        'Address':['Nagpur', 'Kanpur', 'Delhi', 'Aligarh'], 
        'Qualification':['Btech', 'B.A', 'BSc', 'PGDM']} 
 
# Convert the dictionary into DataFrame  
df = pd.DataFrame(data1,index=[0, 1, 2, 3])
 
# Convert the dictionary into DataFrame  
df1 = pd.DataFrame(data2, index=[4, 5, 6, 7])
 
print(df, "\n\n", df1)

     Name  Age  Address Qualification
0   Rahul   27   Nagpur           Msc
1  Princi   25   Kanpur            MA
2  Gaurav   26    Delhi           MCA
3    Anuj   32  Kannuaj           Phd

        Name  Age  Address Qualification
4      Abhi   17   Nagpur         Btech
5    Ayushi   14   Kanpur           B.A
6  Vanshika   23    Delhi           BSc
7    Sarita   24  Aligarh          PGDM

# Now we use keys as an argument.

In [27]:
# using keys 
frames = [df, df1 ]
 
z1= pd.concat(frames, keys=['x', 'y'])
z1

         Name  Age  Address Qualification
x 0     Rahul   27   Nagpur           Msc
  1    Princi   25   Kanpur            MA
  2    Gaurav   26    Delhi           MCA
  3      Anuj   32  Kannuaj           Phd
y 4      Abhi   17   Nagpur         Btech
  5    Ayushi   14   Kanpur           B.A
  6  Vanshika   23    Delhi           BSc
  7    Sarita   24  Aligarh          PGDM

# Concatenating with mixed ndims :

 User can concatenate a mix of Series and DataFrame. The Series will be transformed to DataFrame with the column name as the name of the Series.

In [28]:
import pandas as pd 
 
# Define a dictionary containing employee data 
data1 = {'Name':['Rahul', 'Princi', 'Gaurav', 'Anuj'], 
        'Age':[27, 25, 26, 32], 
        'Address':['Nagpur', 'Kanpur', 'Delhi', 'Kannuaj'], 
        'Qualification':['Msc', 'MA', 'MCA', 'Phd']} 
 
# Convert the dictionary into DataFrame  
df = pd.DataFrame(data1,index=[0, 1, 2, 3])
 

# creating a series
s1 = pd.Series([1000, 2000, 3000, 4000], name='Salary')
 
print(df, "\n\n", s1)

     Name  Age  Address Qualification
0   Rahul   27   Nagpur           Msc
1  Princi   25   Kanpur            MA
2  Gaurav   26    Delhi           MCA
3    Anuj   32  Kannuaj           Phd

 0    1000
1    2000
2    3000
3    4000
Name: Salary, dtype: int64

Now we are going to mix Series and dataframe together

In [29]:
# combining series and dataframe
res = pd.concat([df, s1], axis=1) 
res

     Name  Age  Address Qualification  Salary
0   Rahul   27   Nagpur           Msc    1000
1  Princi   25   Kanpur            MA    2000
2  Gaurav   26    Delhi           MCA    3000
3    Anuj   32  Kannuaj           Phd    4000

# Merging DataFrame

Pandas have options for high-performance in-memory merging and joining. When we need to combine very large DataFrames, joins serve as a powerful way to perform these operations swiftly. Joins can only be done on two DataFrames at a time, denoted as left and right tables. The key is the common column that the two DataFrames will be joined on. It’s a good practice to use keys which have unique values throughout the column to avoid unintended duplication of row values. Pandas provide a single function, merge(), as the entry point for all standard database join operations between DataFrame objects.
There are four basic ways to handle the join (inner, left, right, and outer), depending on which rows must retain their data.

Merging a dataframe with one unique key combination.

In [30]:
# importing pandas module
import pandas as pd 
# Define a dictionary containing employee data 
data1 = {'key': ['K0', 'K1', 'K2', 'K3'],
         'Name':['Jai', 'Princi', 'Gaurav', 'Anuj'], 
        'Age':[27, 24, 22, 32],} 
   
# Define a dictionary containing employee data 
data2 = {'key': ['K0', 'K1', 'K2', 'K3'],
         'Address':['Nagpur', 'Kanpur', 'Allahabad', 'Kannuaj'], 
        'Qualification':['Btech', 'B.A', 'Bcom', 'B.hons']} 
 
# Convert the dictionary into DataFrame  
df = pd.DataFrame(data1)
 
# Convert the dictionary into DataFrame  
df1 = pd.DataFrame(data2) 
  
 
print(df, "\n\n", df1)

  key    Name  Age
0  K0     Jai   27
1  K1  Princi   24
2  K2  Gaurav   22
3  K3    Anuj   32

   key    Address Qualification
0  K0     Nagpur         Btech
1  K1     Kanpur           B.A
2  K2  Allahabad          Bcom
3  K3    Kannuaj        B.hons

In [31]:
# using .merge() function
a1= pd.merge(df, df1, on='key')
 
a1

  key    Name  Age    Address Qualification
0  K0     Jai   27     Nagpur         Btech
1  K1  Princi   24     Kanpur           B.A
2  K2  Gaurav   22  Allahabad          Bcom
3  K3    Anuj   32    Kannuaj        B.hons

# practice question.:-

you #write a pandas program to get the powers of an array valuess element-wise?
Note:-first array elements raised to powers from second array.
X
Y
Z

# interview Question

for python
1- what is slicing and indexing
2- what is command line argument
3- module:-
    datetime, sys, math, random, os, shutil, bs4
4- class and object, inheritance, polymorphism
5- exception handling(try, except, raise, finally)
6- list, tuple, set, dic between difference
7- generator and decorator

for data science
what is numpy and method of numpy
what is pandan and method of pandas.
loc
iloc
merging
joining
EDA
Read csv/ files
matplotlib with method
scatter plot
overfitting
underfitting
type of graphs
properties of graphs


for machine learning:-
what is ML,type of machine learning with examples.
diference between supervised ml, unsupervised ml.

WAP to print table of student record and write excel file(100 records store),
and perform all method of pandas and numpy?
name	roll no.	exam_id	fees	marks	percentage	result
these are columns name.

In [27]:
print("end pandas")

end pandas